odict_keys(['sfeb.0.weight', 'sfeb.1.weight', 'sfeb.1.bias', 'sfeb.1.running_mean', 'sfeb.1.running_var', 'sfeb.1.num_batches_tracked', 'sfeb.3.weight', 'sfeb.4.weight', 'sfeb.4.bias', 'sfeb.4.running_mean', 'sfeb.4.running_var', 'sfeb.4.num_batches_tracked', 'tfeb.0.weight', 'tfeb.1.weight', 'tfeb.1.bias', 'tfeb.1.running_mean', 'tfeb.1.running_var', 'tfeb.1.num_batches_tracked', 'tfeb.4.weight', 'tfeb.5.weight', 'tfeb.5.bias', 'tfeb.5.running_mean', 'tfeb.5.running_var', 'tfeb.5.num_batches_tracked', 'tfeb.7.weight', 'tfeb.8.weight', 'tfeb.8.bias', 'tfeb.8.running_mean', 'tfeb.8.running_var', 'tfeb.8.num_batches_tracked', 'tfeb.11.weight', 'tfeb.12.weight', 'tfeb.12.bias', 'tfeb.12.running_mean', 'tfeb.12.running_var', 'tfeb.12.num_batches_tracked', 'tfeb.14.weight', 'tfeb.15.weight', 'tfeb.15.bias', 'tfeb.15.running_mean', 'tfeb.15.running_var', 'tfeb.15.num_batches_tracked', 'tfeb.18.weight', 'tfeb.19.weight', 'tfeb.19.bias', 'tfeb.19.running_mean', 'tfeb.19.running_var', 'tfeb.19.num_batches_tracked', 'tfeb.21.weight', 'tfeb.22.weight', 'tfeb.22.bias', 'tfeb.22.running_mean', 'tfeb.22.running_var', 'tfeb.22.num_batches_tracked', 'tfeb.25.weight', 'tfeb.26.weight', 'tfeb.26.bias', 'tfeb.26.running_mean', 'tfeb.26.running_var', 'tfeb.26.num_batches_tracked', 'tfeb.28.weight', 'tfeb.29.weight', 'tfeb.29.bias', 'tfeb.29.running_mean', 'tfeb.29.running_var', 'tfeb.29.num_batches_tracked', 'tfeb.33.weight', 'tfeb.34.weight', 'tfeb.34.bias', 'tfeb.34.running_mean', 'tfeb.34.running_var', 'tfeb.34.num_batches_tracked', 'tfeb.38.weight', 'tfeb.38.bias'])


keras model
 Layer (type)                Output Shape              Param #   
=================================================================
 input_2 (InputLayer)        [(None, 1, 30225, 1)]     0         
                                                                 
 conv2d_12 (Conv2D)          (None, 1, 15109, 5)       45        
                                                                 
 batch_normalization_12 (Ba  (None, 1, 15109, 5)       20        
 tchNormalization)                                               
                                                                 
 re_lu_12 (ReLU)             (None, 1, 15109, 5)       0         
                                                                 
 conv2d_13 (Conv2D)          (None, 1, 7553, 32)       800       
                                                                 
 batch_normalization_13 (Ba  (None, 1, 7553, 32)       128       
 tchNormalization)                                               
                                                                 
 re_lu_13 (ReLU)             (None, 1, 7553, 32)       0         
                                                                 
 max_pooling2d_6 (MaxPoolin  (None, 1, 151, 32)        0         
 g2D)                                                            
                                                                 
 permute_1 (Permute)         (None, 32, 151, 1)        0         
                                                                 
 conv2d_14 (Conv2D)          (None, 32, 151, 9)        81        
                                                                 
 batch_normalization_14 (Ba  (None, 32, 151, 9)        36        
 tchNormalization)                                               
                                                                 
 re_lu_14 (ReLU)             (None, 32, 151, 9)        0         
                                                                 
 max_pooling2d_7 (MaxPoolin  (None, 16, 75, 9)         0         
 g2D)                                                            
                                                                 
 conv2d_15 (Conv2D)          (None, 16, 75, 16)        1296      
                                                                 
 batch_normalization_15 (Ba  (None, 16, 75, 16)        64        
 tchNormalization)                                               
                                                                 
 re_lu_15 (ReLU)             (None, 16, 75, 16)        0         
                                                                 
 conv2d_16 (Conv2D)          (None, 16, 75, 23)        3312      
                                                                 
 batch_normalization_16 (Ba  (None, 16, 75, 23)        92        
 tchNormalization)                                               
                                                                 
 re_lu_16 (ReLU)             (None, 16, 75, 23)        0         
                                                                 
 max_pooling2d_8 (MaxPoolin  (None, 8, 37, 23)         0         
 g2D)                                                            
                                                                 
 conv2d_17 (Conv2D)          (None, 8, 37, 33)         6831      
                                                                 
 batch_normalization_17 (Ba  (None, 8, 37, 33)         132       
 tchNormalization)                                               
                                                                 
 re_lu_17 (ReLU)             (None, 8, 37, 33)         0         
                                                                 
 conv2d_18 (Conv2D)          (None, 8, 37, 29)         8613      
                                                                 
 batch_normalization_18 (Ba  (None, 8, 37, 29)         116       
 tchNormalization)                                               
                                                                 
 re_lu_18 (ReLU)             (None, 8, 37, 29)         0         
                                                                 
 max_pooling2d_9 (MaxPoolin  (None, 4, 18, 29)         0         
 g2D)                                                            
                                                                 
 conv2d_19 (Conv2D)          (None, 4, 18, 56)         14616     
                                                                 
 batch_normalization_19 (Ba  (None, 4, 18, 56)         224       
 tchNormalization)                                               
                                                                 
 re_lu_19 (ReLU)             (None, 4, 18, 56)         0         
                                                                 
 conv2d_20 (Conv2D)          (None, 4, 18, 47)         23688     
                                                                 
 batch_normalization_20 (Ba  (None, 4, 18, 47)         188       
 tchNormalization)                                               
                                                                 
 re_lu_20 (ReLU)             (None, 4, 18, 47)         0         
                                                                 
 max_pooling2d_10 (MaxPooli  (None, 2, 9, 47)          0         
 ng2D)                                                           
                                                                 
 conv2d_21 (Conv2D)          (None, 2, 9, 65)          27495     
                                                                 
 batch_normalization_21 (Ba  (None, 2, 9, 65)          260       
 tchNormalization)                                               
                                                                 
 re_lu_21 (ReLU)             (None, 2, 9, 65)          0         
                                                                 
 conv2d_22 (Conv2D)          (None, 2, 9, 90)          52650     
                                                                 
 batch_normalization_22 (Ba  (None, 2, 9, 90)          360       
 tchNormalization)                                               
                                                                 
 re_lu_22 (ReLU)             (None, 2, 9, 90)          0         
                                                                 
 max_pooling2d_11 (MaxPooli  (None, 1, 4, 90)          0         
 ng2D)                                                           
                                                                 
 dropout_1 (Dropout)         (None, 1, 4, 90)          0         
                                                                 
 conv2d_23 (Conv2D)          (None, 1, 4, 2)           180       
                                                                 
 batch_normalization_23 (Ba  (None, 1, 4, 2)           8         
 tchNormalization)                                               
                                                                 
 re_lu_23 (ReLU)             (None, 1, 4, 2)           0         
                                                                 
 average_pooling2d_1 (Avera  (None, 1, 1, 2)           0         
 gePooling2D)                                                    
                                                                 
 flatten_1 (Flatten)         (None, 2)                 0         
                                                                 
 dense_1 (Dense)             (None, 2)                 6         
                                                                 
 softmax_1 (Softmax)         (None, 2)                 0         
                                                              